public class Main {

  // Проект:
  //   распределение по группам (3 человека):
  //   - пожелания прислать до 18:30 понедельника
  //   - в этот раз в одиночку работать нельзя
  //   - работа над проектом - понедельник и среда
  //   - Темы: HashMap, разбиение на методы, обработка исключений
  //   - тема проекта (у всех одинаковая) будет озвучена в понедельник
  // Работа над задачей с нуля:
  // - описание функционала (technical requirements):
  //   - какие данные (и откуда) поступают на вход (input)
  //   - какие данные (и куда) поступают на выход (output)
  // - составление алгоритма:
  //   - общей идеи (оценка эффективности)
  //   - разбиение на компоненты (классы, методы, ...)
  //     - (выбор подходящих паттернов проектирования)
  //     - проработка интерфейсов классов или сигнатур методов
  // - реализация
  // - интеграция (объединение компонентов)
  // - тестирование итогового продукта
  // Вопросы:
  // - scanner.hasNextLine()?
  // - scanner.nextLine() vs. scanner.next()
  // - форматированный вывод (очень простая часть функционала)
  // - substring()

  // Задача:
  // Как известно, в США президент выбирается не прямым голосованием,
  // а путем двухуровневого голосования.
  // Сначала проводятся выборы в каждом штате и определяется победитель выборов
  // в данном штате.
  // Затем проводятся государственные выборы: на этих выборах каждый штат
  // имеет определенное число голосов — число выборщиков от этого штата.
  // На практике, все выборщики от штата голосуют в соответствии с результами
  // голосования внутри штата, то есть на заключительной стадии выборов в
  // голосовании участвуют штаты, имеющие различное число голосов.
  //
  // Каждая запись содержит фамилию кандидата и число голосов,
  // отданных за него в одном из штатов.
  // Подведите итоги выборов: для каждого из участника голосования определите
  // число отданных за него голосов.

  // Формат ввода:
  // McCain 10
  // McCain 5
  // Obama 9
  // Obama 8
  // McCain 1

  // Формат вывода:
  // McCain 16
  // Obama 17
  public static void main(String[] args) {

  }
}
