public class Main {

  // юнит-тесты vs. интеграционные тесты
  // unit tests (юнит-тесты, модульные тесты) -- тесты для каждого отдельного кусочка программы
  //   (обычно несколько тестов на каждый метод)
  //   всегда ответственность разработчика
  // integration tests (интеграционные тесты) -- тесты для проверки того, как эти кусочки
  //   программы или даже разные программы работают вместе
  //   может писать как разработчик, так и QA-инженер
  public static void main(String[] args) {
    System.out.println("Hello world!");
  }
}
